docs/SequenceDiagram/SequenceDiagram.md
```mermaid
sequenceDiagram
    actor I as 사용자
    participant OrderFacade as OrderFacade
    participant Coupon as Coupon
    participant Product as Product
    participant Order as Order
    participant User as User
    participant Payment as Payment
    participant DataPlatform as DataPlatform

    I ->> OrderFacade : 주문 요청
    OrderFacade ->> Coupon : 쿠폰 확인 요청
    Coupon ->> Coupon : 쿠폰 사용기간 확인
    alt 쿠폰 사용 불가하면
        Coupon -->> OrderFacade : 쿠폰 사용 실패
        OrderFacade -->> I : 주문 실패
    else 쿠폰 사용 가능하면
        Coupon -->> OrderFacade : 쿠폰 사용
        OrderFacade ->> Product : 판매 상태, 재고 차감 요청
        Product ->> Product : 판매 상태, 재고 차감
        alt 판매 중단 상품 or 재고 부족하면
            Product -->> OrderFacade : 실패
            Order -->> I : 주문 실패
        else 판매 중 상품 and 재고 있으면
            Product -->> OrderFacade : 재고 차감 및 금액 계산
            OrderFacade ->> Order : 주문 생성 요청
            Order -->> OrderFacade : 주문 생성
            OrderFacade ->> User : 잔액 사용 요청
            alt 결제 금액 > 보유 잔액
                User -->> OrderFacade : 잔액 사용 실패
                OrderFacade -->> I : 주문 실패
            else 결제 금액 <= 보유 잔액
                User -->> OrderFacade : 잔액 사용
                OrderFacade ->> Payment : 결제 생성 요청
                Payment ->> DataPlatform : 데이터 외부로 전송
                DataPlatform -->> Payment : 외부 응답
                Payment -->> OrderFacade : 결제 성공
                OrderFacade -->> I : 주문 성공
            end
        end
    end
    
```
