docs/sequanceDiagram/SequenceDiagram.puml
@startuml
title 잔액 충전
actor "사용자" as Users
participant "User" as User
participant "BalanceHistory" as BalanceHistory

Users -> User : 잔액 충전 요청
alt 충전 금액 <= 0
        User -> Users : 잔액 충전 실패
else 충전 금액 > 0
    User -> User : 보유 잔액 조회 + 요청 잔액
    User -> BalanceHistory : 잔액 충전 기록 요청
    BalanceHistory -> BalanceHistory : 잔액 충전 기록
    BalanceHistory -> User : 성공
    User -> Users : 잔액 충전 성공
end
@enduml

@startuml
title 상품 조회
actor "사용자" as Users
participant "Product" as Product

Users -> Product : 상품 목록 조회 요청
Product -> Product : 판매 상태가 SELLING인 상품 조회
Product -> Users : 상품 목록 반환
@enduml

@startuml
title 쿠폰 발급
actor "사용자" as Users
participant "Coupon" as Coupon
participant "UserCoupon" as UserCoupon

Users -> Coupon : 쿠폰 발급 요청
Coupon -> Coupon : 선착순 재고 조회
alt 쿠폰 선착순 재고 없으면
    Coupon -> Users : 쿠폰 발급 실패
else 쿠폰 선착순 재고 있으면
Coupon -> UserCoupon : 사용자가 해당 쿠폰이 있는지 조회
UserCoupon -> UserCoupon : 해당 쿠폰 조회
UserCoupon -> Coupon : 사용자가 해당 쿠폰이 있는지 반환
    alt 사용자가 해당 쿠폰이 없으면
        Coupon -> Coupon : 쿠폰 선착순 재고 차감
        Coupon -> Users : 쿠폰 발급 성공
    else 사용자가 해당 쿠폰이 있으면
        Coupon -> Users : 쿠폰 발급 실패
    end
end
@enduml

@startuml
title 주문
actor "사용자" as Users
participant "Order" as Order
participant "OrderProduct" as OrderProduct
participant "User" as User
participant "Product" as Product
participant "Coupon" as Coupon

Users -> Order : 주문 요청
Order -> Coupon : 쿠폰 확인 요청
Coupon -> Coupon : 쿠폰 사용기간 확인
alt 쿠폰 사용 불가하면
    Coupon -> Order : 실패
    Order -> Users : 주문 실패
else 쿠폰 사용 가능하면
    Coupon -> Coupon : 쿠폰 사용 처리
    Coupon -> Order : 쿠폰 사용 완료
    Order -> Product : 판매 상태, 재고 조회 요청
    Product -> Product : 판매 상태, 재고 반환
    alt 판매 중단 상품 or 재고 부족하면
        Product -> Order : 실패
        Order -> Users : 주문 실패
    else 판매 중 상품 and 재고 있으면
        Product -> Product : 재고 차감 및 금액 계산
        Product -> Order : 금액 반환
        Order -> Order : 쿠폰 적용 최종 결제 금액 계산
        Order -> User : 잔액 조회 요청
        User -> User : 잔액 조회
        alt 결제 금액 > 보유 잔액
            User -> Order: 실패
            Order -> Users : 주문 실패
        else 결제 금액 <= 보유 잔액
            User -> OrderProduct : 상품 주문 처리 요청
            OrderProduct -> OrderProduct : 상품 주문 처리
            OrderProduct -> Order : 주문 처리 요청
            Order -> Order : 주문 처리
            Order -> Users : 주문 성공
        end
    end
end
@enduml

@startuml
title 결제
actor "사용자" as Users
participant "Payment" as Payment
participant "BalanceHistory" as BalanceHistory
participant "User" as User
participant "Order" as Order

Users -> Payment : 결제 요청
Payment -> Order : 주문 정보 조회 요청
Order -> Order : 주문 정보 조회
Order -> Payment : 결제 금액 전송
Payment -> User : 보유 잔액 차감 요청
User -> User : 보유 잔액 차감
User -> BalanceHistory : 잔액 사용 처리 요청
BalanceHistory -> BalanceHistory : 잔액 사용 처리
BalanceHistory -> Payment : 잔액 사용 성공
Payment -> Users : 결제 성공
@enduml

@startuml
title 인기 상품 조회
actor "사용자" as Users
participant "OrderProduct" as OrderProduct

Users -> OrderProduct : 인기 상품 조회 요청
OrderProduct -> OrderProduct : 인기 상품 조회
OrderProduct -> Users : 인기 상품 조회 성공
@enduml
